TSD_TK/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>НДС20</name>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
</mdclass:Enum>

TSD_TK/src/CommonModules/ЦенообразованиеКлиентСерверПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает числовое значение ставки НДС по значению перечисления
//
// Параметры:
// 		СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС.
//
// Возвращаемое значение:
// 		Число - Значение ставки НДС числом.
//
Функция ПолучитьСтавкуНДСЧислом(Знач СтавкаНДС) Экспорт
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
		Возврат 0.20;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Возвращает числовое значение ставки НДС по значению перечисления
//
// Параметры:
// 		СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС.
//
// Возвращаемое значение:
// 		Число - Значение ставки НДС числом.
//
Функция ПолучитьСтавкуНДСЦелымЧислом(Знач СтавкаНДС) Экспорт
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
		Возврат 20;
		
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0") Тогда
		Возврат 0;
		
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
		Возврат 0;
		
	Иначе
		Возврат Неопределено; // Без НДС
		
	КонецЕсли;
	
КонецФункции

// Возвращает значение перечисления ставки НДС по числовому значению
//
//  Параметры:
//  Число - Значение ставки НДС числом.
//
//  Возвращаемое значение:
//  СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС.
//
Функция ПолучитьСтавкуНДС(Знач СтавкаНДСЗначение, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Если СтавкаНДСЗначение = 20 ИЛИ СтавкаНДСЗначение = "20" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
		
	ИначеЕсли СтавкаНДСЗначение = 0 ИЛИ СтавкаНДСЗначение = "0" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
		
	ИначеЕсли СтавкаНДСЗначение = Неопределено ИЛИ ВРег(СтавкаНДСЗначение) = "NONE" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		
	Иначе
		Если ЗначениеПоУмолчанию = Неопределено Тогда
			Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
		Иначе
			Возврат ЗначениеПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
КонецФункции

#КонецОбласти
